app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
    def index
        @places = Place.all # .find(id=users_id)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
        render json: Place.find(params[:id])

INSERT INTO "places" ("name", "place_type", "location", "address", "phone", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "q"], ["place_type", "q"], ["location", "q"], ["address", "q"], ["phone", "1"], ["rating", 1], ["created_at", "2016-12-02 22:37:48.579999"], ["updated_at", "2016-12-02 22:37:48.579999"]]
---
    def create
        @place = current_user.places.build(place_params)

        if @place.save

UPDATE "places" SET "name" = $1, "place_type" = $2, "location" = $3, "address" = $4, "phone" = $5, "rating" = $6, "updated_at" = $7 WHERE "places"."id" = $8  [["name", "asdfg"], ["place_type", ""], ["location", ""], ["address", ""], ["phone", ""], ["rating", nil], ["updated_at", "2016-12-04 17:05:09.444893"], ["id", 19]]
---
    def update
        if @place.update(place_params)

SELECT  "places".* FROM "places" WHERE "places"."user_id" = $1 AND "places"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
---
    def set_place
        @place = current_user.places.find(params[:id])